## Flight Seat Discount
**Validations:**

* Email ID is valid
* The mobile phone is valid
* Ticketing date is before travel date
* PNR is 6 characters and Is alphanumeric
* The booked cabin is valid (one of Economy, Premium Economy,Business, First)

In [1]:
import pandas as pd
from validate_email import validate_email
cabin=['Economy', 'Premium Economy','Business','First']

In [2]:
df=pd.read_csv("input.csv", header=0)

In [3]:
df.info()
df1=df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   First_name      5 non-null      object
 1   Last_name       5 non-null      object
 2   PNR             5 non-null      object
 3   Fare_class      5 non-null      object
 4   Travel_date     5 non-null      object
 5   Pax             5 non-null      int64
 6   Ticketing_date  5 non-null      object
 7   Email           5 non-null      object
 8   Mobile_phone    5 non-null      int64
 9   Booked_cabin    5 non-null      object
dtypes: int64(2), object(8)
memory usage: 528.0+ bytes

In [4]:
df.head()

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
1,Monin,Sankar,PQ234,C,2019-08-30,2,2019-05-22,monin@zzz.com,9876543211,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
3,Kalyani,Ben,A1B2C3,M,2019-04-30,1,2019-05-21,​kben@zzz.com​,9876543213,PremiumEconomy
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [5]:
df=df[df['PNR'].astype(str).str.len()==6]
df=df[df['PNR'].astype(str).str.isalnum()]
df

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
3,Kalyani,Ben,A1B2C3,M,2019-04-30,1,2019-05-21,​kben@zzz.com​,9876543213,PremiumEconomy
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [6]:
df=df[df['Mobile_phone'].astype(str).str.len()==10]
df=df[df['Mobile_phone'].astype(str).str.isdigit()]
df

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
3,Kalyani,Ben,A1B2C3,M,2019-04-30,1,2019-05-21,​kben@zzz.com​,9876543213,PremiumEconomy
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [7]:

booldatevalidate=pd.to_datetime(df['Travel_date'], utc=True).dt.strftime('%Y-%m-%d %H:%M:%S')>=pd.to_datetime(df['Ticketing_date'], utc=True).dt.strftime('%Y-%m-%d %H:%M:%S')
df=df[booldatevalidate]
df

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [8]:
df=df[df['Email'].astype(str).apply(lambda x:validate_email(x))]
df

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [9]:
df=df[df['Booked_cabin'].apply(lambda x:str(x) in cabin)]
df

,First_name,Last_name,PNR,Fare_class,Travel_date,Pax,Ticketing_date,Email,Mobile_phone,Booked_cabin
0,Abhishek,Kumar,ABC123,F,2019-07-31,2,2019-05-21,abhishek@zzz.com,9876543210,Economy
2,Radhika,Suresh,ZZZ345,T,2019-05-31,4,2019-05-21,radhika@zzz,9876543212,Business
4,Somnath,Batra,X1Y2Z4,Z,2019-07-25,3,2019-05-23,sbatra@zzz.com,9876543214,Economy

In [10]:
df.index

Int64Index([0, 2, 4], dtype='int64')

In [11]:
list(df1.index)

[0, 1, 2, 3, 4]

In [12]:
def intersection(lst1, lst2):
    lst3 = [value for value in lst1 if value not in lst2]
    return lst3

In [13]:
fal=intersection(list(df1.index),list(df.index))
fal

[1, 3]

In [14]:
df1=df1.loc[fal,:]

Fare class A - E will
have discount code OFFER_20, F - K will have discount code OFFER_30, L - R will have OFFER_25;
rest will have no offer code

In [15]:
def code(el):
    el=str(el)
    if el>='A' and el <= 'E':
        return "OFFER_20"
    elif el>='F' and el <= 'K':
        return "OFFER_30"
    elif el>='L' and el <= 'R':
        return "OFFER_25"
    else:
        return None

In [16]:
df['Discount_code']=df['Fare_class'].apply(code)

In [17]:
df
validated=df
errored=df1

In [18]:
# df.to_csv (r'C:\Users\Ron\Desktop\export_dataframe.csv', index = False, header=True)
validated.to_csv(r'validated.csv',index=False)
errored.to_csv(r'errored.csv',index=False)